app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function doLogin()
    {
        $session = session();
        $model = new UserModel();
        $username = $this->request->getVar("username");
        $password = $this->request->getVar("password");
        $data = $model->where("username", $username)->first();