app/Controllers/KaryaController.php

SELECT *
FROM `karya`
---
    public function index()
    {
        $model = new KaryaModel();
        $data['karya'] = $model->findAll();

INSERT INTO `karya` (`user_id`, `title`, `description`, `tahun`, `file_path`) VALUES ('5', 'fdsafhdaf', 'dsjsadsaj', '2024', '20240719/1721404000_d0afe01751fa02d050f5.pdf')
---
    public function store()
    {
        $model = new KaryaModel();
        $file = $this->request->getFile('file');

        if (!$file->isValid()) {
            throw new \RuntimeException($file->getErrorString().'('.$file->getError().')');
        }

        $filePath = $file->store();

        $data = [
            'user_id' => session()->get('id'),
            'title' => $this->request->getVar('title'),
            'description' => $this->request->getVar('description'),
            'tahun' => $this->request->getVar('tahun'),
            'file_path' => $filePath,
        ];
        $model->save($data);

SELECT *
FROM `karya`
WHERE `karya`.`id` = '14'
---
    public function edit($id)
    {
        $model = new KaryaModel();
        $data['karya'] = $model->find($id);

SELECT *
FROM `karya`
WHERE `id` = '13'
 LIMIT 1
UPDATE `karya` SET `title` = 'ball', `description` = 'dragon', `tahun` = '2025', `file_path` = '20240719/1721404731_5217c64ce94b14da2bb5.pdf'
WHERE `karya`.`id` IN ('14')
---
    public function update($id)
    {
        $model = new KaryaModel();
        $file = $this->request->getFile('file');
        $oldFile = $model->where('id', $id)->first();
        if ($file->isValid()) {
            $filePath = $file->store();
            $data = [
                'title' => $this->request->getVar('title'),
                'description' => $this->request->getVar('description'),
                'tahun' => $this->request->getVar('tahun'),
                'file_path' => $filePath,
            ];
        } else {
            $data = [
                'title' => $this->request->getVar('title'),
                'description' => $this->request->getVar('description'),
            ];
        }
        if($oldFile['file_path']){
            unlink(WRITEPATH . 'uploads/' . $oldFile['file_path']);
        }
        $model->update($id, $data);

SELECT *
FROM `karya`
WHERE `karya`.`id` = '2'
DELETE FROM `karya`
WHERE `id` IN ('2')
---
    public function delete($id)
    {
        // $model = new KaryaModel();
        // $data = $model->where('id', $id)->first();
        // $file = ROOTPATH . 'writable/uploads/'. $data['file_path'];
        // delete_files($file);
        // $model->delete($id);
        // return redirect()->to('/karya');
        $model = new KaryaModel();

        // Ambil data karya berdasarkan ID
        $karya = $model->find($id);

        if ($karya) {
            // Hapus file jika ada
            $filePath = WRITEPATH . 'uploads/' . $karya['file_path'];
            if (file_exists($filePath)) {
                unlink($filePath);
            }

            // Hapus data dari database
            $model->delete($id);