app/Controllers/UserController.php

    public function index()
    {
        $model = new UserModel();
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`

    public function create()
    {
        $roleModel = new RoleModel();
        $data['roles'] = $roleModel->findAll();
---
SELECT *
FROM `roles`